<template>
  <div class="channel">
    
    <div class="channel_banner">
        <div @click="channelBtn(1)" :class=" {'channer_active':channelNav == 1} ">渠道代理</div>
        <div @click="channelBtn(2)" :class=" {'channer_active':channelNav == 2} ">隐私政策</div>
        <div @click="channelBtn(3)" :class=" {'channer_active':channelNav == 3} ">用户协议</div>
        <div @click="channelBtn(4)" :class=" {'channer_active':channelNav == 4} ">售后支持</div>
    </div>

    <div class="channel_nav_box">
        <div v-show=" channelNav == 1 " class="channel_nav1">
            <div class="channel_nav1_img"><img src="https://ag-home.oss-cn-beijing.aliyuncs.com/imgs/banner08.png" alt=""></div>
            <div class="channel_nav1_title">选择艾侗游的理由</div>
            <div class="channel_nav1_icon">
                <div>
                    <img src="https://ag-home.oss-cn-beijing.aliyuncs.com/imgs/icon_pro.png" alt="">
                </div>
                <div>
                    <img src="https://ag-home.oss-cn-beijing.aliyuncs.com/imgs/icon_technology.png" alt="">
                </div>
                <div>
                    <img src="https://ag-home.oss-cn-beijing.aliyuncs.com/imgs/icon_platform.png" alt="">
                </div>
                <div>
                    <img src="https://ag-home.oss-cn-beijing.aliyuncs.com/imgs/icon_brand.png" alt="">
                </div>
            </div>
            <div class="channel_nav1_title">项目价值</div>
            <div class="channel_av1_text">
                <p>为了有效解决旅行社在目前遇到的问题，艾侗游推出了一款智能硬件+旅游管理APP产品——<b>全球首款旅行带团专业智能音箱</b>。针对一系列面向不同旅游带团需求和应用场景研发的出行解决方案，满足旅游企业在数字化时代对于效率和灵活性的更高需求。</p>
                <p>艾侗游将旅游行业中带团环节价值提升，吸引更多的导游和更多的游客使用Aetosgo 智能团游音箱，在传统行业向互联网+大数据转型过程中、利用艾侗游可有效提升旅行社与导游的服务品质，产生巨大社会效益。可有效提升游客旅游质量的同时，为旅游企业、旅行社、导游、需要带团的人增收减支，在互联网+旅游大数据的的红利下，最终实现多方共赢。</p>
            </div>
            <div class="channel_nav1_title">与艾侗游 , 你能获得什么</div>
            <div class="channel_nav1_icon2">
                <img src="https://ag-home.oss-cn-beijing.aliyuncs.com/imgs/obtain.png" alt="">
                <!-- <div class="rel_icon2">
                    <div class="icon2_abl1"></div>
                    <div class="icon2_abl2"></div>
                </div>
                <div class="channel_nav1_icon2_b">
                    <div class="bor_r ">
                            <img src="https://ag-home.oss-cn-beijing.aliyuncs.com/imgs/icon_pro2.png" alt="">
                        </div>
                    <div class="bor_r ">
                        <img src="https://ag-home.oss-cn-beijing.aliyuncs.com/imgs/icon_earnings.png" alt="">
                    </div>
                    <div class="">
                        <img src="https://ag-home.oss-cn-beijing.aliyuncs.com/imgs/icon_technology2.png" alt="">
                    </div>
                </div>
                <div class="channel_nav1_icon2_t">
                    <div class="bor_r">
                        <img src="https://ag-home.oss-cn-beijing.aliyuncs.com/imgs/icon_training.png" alt="">
                    </div>
                    <div class="bor_r">
                        <img src="https://ag-home.oss-cn-beijing.aliyuncs.com/imgs/icon_aftersale.png" alt="">
                    </div>
                    <div>
                        <img src="https://ag-home.oss-cn-beijing.aliyuncs.com/imgs/icon_brand2.png" alt="">
                    </div>
                </div> -->
            </div>
            <div class="channel_nav1_title">加入艾侗游，您需要具备的条件</div>
            <div class="channel_nav1_icon3">
                <img src="https://ag-home.oss-cn-beijing.aliyuncs.com/imgs/enterprise_qualification.png" alt="">
                <img src="https://ag-home.oss-cn-beijing.aliyuncs.com/imgs/economic_conditions.png" alt="">
                <img src="https://ag-home.oss-cn-beijing.aliyuncs.com/imgs/ability_operate.png" alt="">
                <img src="https://ag-home.oss-cn-beijing.aliyuncs.com/imgs/value_honesty.png" alt="">
            </div>
            <div class="channel_nav1_title">加盟流程</div>
            <div class="channel_nav1_icon4"><img src="https://ag-home.oss-cn-beijing.aliyuncs.com/imgs/joining_process.png" alt=""></div>
            <div class="channel_nav1_title">想要成为代理商、经销商</div>
            <div class="channel_nav1_icon5"><el-button @click="showBtn" style="width:196px;height:46px" type="primary">立即申请</el-button></div>
            <div class="channel_dialog">
                <el-dialog :lock-scroll="false" title="" :visible.sync="dialogFormVisible">
                    <el-form :model="form" class="form_box">
                        <div class="form_box_title">请填写申请表</div>
                        
                        <div class="form_box_content">
                            <el-form-item label="*" :label-width="formLabelWidth">
                            <el-input v-model="form.name" auto-complete="off" placeholder="姓名"></el-input>
                            </el-form-item>

                            <el-form-item label="*" :label-width="formLabelWidth">
                            <el-input v-model="form.phone" auto-complete="off" placeholder="手机号"></el-input>
                            </el-form-item>

                            <el-form-item label="*" :label-width="formLabelWidth">
                            <el-input v-model="form.path" placeholder="营业地址"></el-input>
                            </el-form-item>

                            <el-form-item label="" :label-width="formLabelWidth">
                                <el-select style=""  v-model="form.capital.city" @change="capitalBtn(form.capital.city)" :disabled="capitalArr.length<1" placeholder="请选择省份">
                                    <el-option 
                                    v-for="(item,index) in capitalArr"
                                    :key="index" 
                                    :label="item.city" 
                                    :value="item.city"
                                   ></el-option>
                                </el-select>
                                <el-select style="" v-model="form.city.city" @change="cityBtn(form.city.city)" :disabled="cityArr.length<1" placeholder="请选择城市">
                                    <el-option
                                    v-for="(item,index) in cityArr"
                                    :key="index" 
                                    :label="item.city" 
                                    :value="item.city"></el-option>
                                </el-select>
                                <el-select style="" v-model="form.town.city" @change="townBtn(form.town.city)" :disabled="townArr.length<1"  placeholder="请选择区县">
                                    <el-option
                                    v-for="(item,index) in townArr"
                                    :key="index" 
                                    :label="item.city" 
                                    :value="item.city"></el-option>
                                </el-select>
                            </el-form-item>

                            <el-form-item label="*" :label-width="formLabelWidth">
                            <el-input type="textarea"  v-model="form.content" auto-complete="off" placeholder="请描述您的需求，我们会尽快联系您"></el-input>
                            </el-form-item>
                        </div>
                        <el-form-item label=" " :label-width="formLabelWidth">
                            <el-button style="width:85%;margin-top:2px" type="primary" @click="informBtn">提 交</el-button>
                        </el-form-item>
                    </el-form>
                    <div style="padding: 22px 0 0 70px;color:#888;font-size:14px">
                        <div>" <span style="color:red">*</span> "号为必填项</div>
                        <div style="margin-top:10px">同一手机号每天最多只能提交一次，不可重复提交</div>
                    </div>
                </el-dialog>
            </div>
        </div>

        <div v-show=" channelNav == 2 " class="channel_nav2" style="padding-top:-40px">
            <div>
                <div><b>欢迎您使用上海艾侗游科技有限公司（以下简称：艾侗游）服务！我们非常重视您的隐私保护和个人信息保护。本隐私政策适用于您通过任何方式对艾侗游各项服务的访问和使用。</b></div>
                <div>欢迎您使用艾侗游服务和产品。艾侗游是一款具备多种功能、软硬结合及云服务的智能旅游出行单品。硬件部分除了具备音箱外放功能外，还具备了高保真扩音、GPS、北斗、双频Wi-Fi（支持2.4G/5G）、4G网络、蓝牙4.1、照明和一键快速救助等多种功能；软件方面，具备了无线讲解，安全定位、用户管理、创建游团、行程安排、导游信息查询、评价系统、智能翻译（20多种语言）天气预报等出行所需功能。<b>用户可能通过不同方式使用艾侗游服务，包括艾侗游官方网站、包含艾侗游的APP应用、艾侗游的微信公众号、艾侗游的微博号等 （以下统称“艾侗游产品及服务”）。 艾侗游在不同场景下提供的服务不尽相同，取决于应用或设备的具体类型。</b></div>
                <div>此隐私权政策旨在帮助您了解我们会收集哪些数据、为什么收集这些数据，会利用这些数据做些什么及如何保护这些数据。请您务必认真阅读本隐私政策，在确认充分了解并同意后使用艾侗游服务。<b>使用艾侗游，即表示您同意艾侗游隐私政策。</b>如果您或您的监护人不同意本隐私政策的任何内容，您应该立即停止使用。</div>
                <div>您可以在个人中心中的隐私设置或产品功能中找到一些控制项，通过这些控制项，您可以对自己的信息进行动态管理。</div>
                <div><b>请注意：当您通过艾侗游使用第三方产品和服务时，如果向该第三方提供您的个人信息，您的信息将适用该第三方的隐私政策。</b></div>
                <div>我们深知个人信息对您的重要性，也深知为您的信息提供有效保护是我们业务健康可持续发展的基石。感谢您对艾侗游的使用和信任！我们致力于维持您对我们的信任，恪守以下原则，保护您的个人信息：权责一致原则、目的明确原则、选择同意原则、最少够用原则、确保安全原则、主体参与原则、公开透明原则等。</div>
                <div><b>我们郑重承诺，我们将按业界成熟的安全标准，采取相应的安全保护措施来保护您的个人信息。</b></div>
            </div>
            <div>
                <div><h3>一、我们如何收集和使用您的个人信息</h3></div>
                <div>个人信息是指以电子或者其他方式记录的能够单独或者与其他信息结合识别特定自然人身份或者反映特定自然人活动情况的各种信息。艾侗游数据等与您个人无关的信息不属于您的个人信息。</div>
                <div>为了向您提供更好、更个性化的产品和服务，当您使用以下服务、功能或设置时，我们会以下列方式收集和使用您的个人信息：</div>
                <div><h4>1.您直接提供给我们的个人信息</h4></div>
                <div>您使用艾侗游服务，可以登录经注册的艾侗游通用帐号。当注册艾侗游通用账号时，您需向我们提供以下信息：帐号名称、头像、密保手机并创建密码等。艾侗游会不时针对新推出的服务和功能发起运营活动，如果您参加相关运营活动，我们会通过运营活动界面收集包括但不限于您的身份信息、联系方式、交易帐号类信息，以便与您取得联系，向您发运营奖励等。若您不参加相关运营活动则无需提供前述信息。</div>
                <div><h4>2.我们通过您对艾侗游的使用收集的信息</h4></div>
                <div>1）设备信息。</div>
                <div>在您使用艾侗游产品及服务，或使用相关功能时，艾侗游会自动接收并记录您的终端设备上的信息，包括但不限于硬件类型、型号、固件编号、区域和语言设置、硬件MAC地址、硬件系统版本号、您的IP地址、终端设备的类型、软硬件特征信息、您浏览的页面、点击等操作行为 、互联网服务提供商、独立设备标识符、iOS广告标识符（IDFA）、网卡（MAC）地址、国际移动设备识别码（IMEI）、设备型号、终端制造厂商、终端设备操作系统版本、会话启动/停止时间、语言所在地、时区和网络状态（WiFi等）、硬盘、CPU和电池使用情况等数据。</div>
                <div>我们收集您的设备信息以便为不同的设备终端提供更适配的服务，我们会感知同一WiFi下其他搭载艾侗游设备的信息，以便实现设备的互联互通，使您在不同设备间使用的艾侗游服务可无缝衔接，跨终端享受个性化服务。</div>
                <div>2）日志信息。</div>
                <div>当您使用艾侗游服务时，我们的服务器会自动记录您的日志信息，您发布的报错信息、反馈和评论信息，您上传的图片信息、您的IP 地址、浏览器的类型和使用的语言、网络运营商的信息、您访问服务的日期、时间、时长等。为了给您带来更便捷的搜索服务并不断完善艾侗游服务，我们可能会使用浏览器网络存储等机制（包括HTML5）和应用数据缓存，收集您设备上的信息并进行本地存储。</div>
                <div>我们会基于前述信息以及您的收藏数据对您的偏好、习惯、位置作特征分析和用户画像，以便为您提供更适合您的定制化服务，例如向您展现或推荐相关程度更高（而非普遍推送）的搜索结果、信息流或者广告/推广信息结果。我们可能会将您在艾侗游中的画像信息与您在其他艾侗游服务中的信息（包括个人信息）结合起来，以便艾侗游整体能更好地满足您的需求。</div>
                <div>3）位置信息。</div>
                <div>建议您进行初始设置时提供位置信息，以便为您设置正确的时区并向您提供与您位置相关的天气信息、交通信息、以及与位置相关的信息。当您开启设备定位功能并使用我们基于位置提供的相关服务时，我们可能会收集和处理有关您的位置信息、行踪轨迹，以使得您不需要手动输入自身地理坐标就可获得相关服务。<b>位置信息属于敏感个人信息，您可以通过系统授权关闭定位功能，停止我们对您的地理位置信息的收集，但之后您可能将无法使用路况提醒、路径规划、安全定位等相关服务或功能，或者无法达到相关服务拟达到的效果。</b></div>
                <div>4） 第三方产品或服务信息。</div>
                <div>艾侗游会接入丰富的第三方技能。当您利用艾侗游使用或订购相关技能时，您授权我们将提供该功能所必要的信息提供给为您提供服务的第三方（包括但不限于您的身份信息和位置信息），并授权我们间接向第三方获取必要的相关信息（包括但不限于您的订单信息），以便为您提供服务。</div>
                <div><b>艾侗游会与第三方智能终端设备、技能开发商、方案商等合作，也会提供通向第三方网页或广告主网页的链接，这些第三方对个人信息收集、使用、处理等不适用本隐私政策。请直接与第三方沟通以了解他们的隐私政策和实践。</b></div>
                <div><h4>3.事先征得授权同意的例外</h4></div>
                <div><b>请注意：在以下情形中，收集、使用个人信息无需事先征得您的授权同意：</b></div>
                <div>
                    <p>(1) 与国家安全、国防安全直接相关的；</p>
                    <p>(2) 与公共安全、公共卫生、重大公共利益直接相关的；</p>
                    <p>(3) 与犯罪侦查、起诉、审判和判决执行等直接有关的；</p>
                    <p>(4) 出于维护您或其他个人的生命、财产等重大合法权益但又很难得到本人同意的；</p>
                    <p>(5) 所收集的个人信息是您自行向社会公众公开的；</p>
                    <p>(6) 从合法公开披露的信息中收集个人信息的，如合法的新闻报道、政府信息公开等渠道；</p>
                    <p>(7) 根据您的要求向您提供产品或服务所必需的；</p>
                    <p>(8) 用于维护所提供的产品或服务的安全稳定运行所必需的，例如发现、处置产品或服务的故障；</p>
                    <p>(9) 法律法规规定的其他情形。</p>
                </div>
                <div><h4>4.个人信息的匿名化处理</h4></div>
                <div>在收集到您的个人信息后，我们将通过技术手段及时对数据进行匿名化处理。在不泄露您个人信息的前提下，艾侗游有权对匿名化处理后的用户数据库进行挖掘、分析和利用（包括商业性使用）。</div>
                <div><h4>5.您授权我们在您使用艾侗游产品及服务的期间使用您的个人信息，若您注销帐号，我们将停止使用并删除您的个人信息。</h4></div>
                <div><h4>6.设备权限调用</h4></div>
                <div><b>艾侗游在提供服务过程中，经过您的授权会调用您的一些设备权限（包括但不限于定位、蓝牙、麦克风、相机、相册等）。您可以在设备的设置功能中选择关闭部分或全部权限，从而拒绝艾侗游收集相应的个人信息。在不同设备中，权限显示方式及关闭方式可能有所不同，具体请参考设备及系统开发方说明或指引。</b>我们可能使用您的信息用于安全防范和诈骗监测等，以预防、发现、调查欺诈、危害安全、非法或违反与我们的协议、政策或规则的行为，以保护您、我们或我们的关联公司、合作伙伴及社会公众的合法权益。</div>
                <div><h4>7.当我们要将信息用于本隐私政策未载明的其它用途时，会事先征求您的同意。当我们要将基于特定目的收集而来的信息用于其他目的时，会事先征求您的同意。</h4></div> 
            </div>

            <div>
                <div><h3>二、我们如何使用Cookie和同类技术</h3></div>
                <div><b>Cookie和匿名标识符工具。</b>Cookie是支持服务器端（或者脚本）在客户端上存储和检索信息的一种机制。当您使用艾侗游产品或服务时，我们会向您的设备发送一个或多个Cookie或匿名标识符。当您与艾侗游服务进行交互时，我们允许Cookie或者匿名标识符发送给艾侗游服务器。Cookie 通常包含标识符、站点名称以及一些号码和字符。运用Cookie技术，艾侗游能够了解您的使用习惯，记住您的偏好，省去您输入重复信息的步骤，为您提供更加周到的个性化服务，或帮您判断您账户的安全性。Cookie还可以帮助我们统计流量信息，分析页面设计和广告的有效性。</div>
                <div>我们不会将 Cookie 用于本政策所述目的之外的任何用途。您可根据自己的偏好管理或删除 Cookie。有关详情，请参见 AboutCookies.org。</div>
            </div>

            <div>
                <div><h3>三、我们如何共享、转让、公开披露您的个人信息。</h3></div>
                <div>1. 我们会以高度的勤勉义务对待您的信息。在获得您的明确同意后，我们会与其他方共享您的个人信息。我们可能会根据法律法规规定，或按照法律法规、法律程序的要求或强制性的政府要求或司法裁定，对外共享您的个人信息。</div>
                <div>2. 仅为实现本隐私政策中声明的目的，我们的某些服务将由授权合作伙伴提供。我们可能会与合作伙伴共享您的某些个人信息，以提供更好的客户服务和用户体验。我们仅会出于合法、正当、必要、特定、明确的目的共享您的个人信息，并且只会共享提供服务所必要的个人信息。我们的合作伙伴无权将共享的个人信息用于任何其他用途。</div>
                <div><h4>3. 为给您提供服务，您同意我们与以下第三方授权合作伙伴共享必要信息。</h4></div>
                <div><b>1） 软件服务提供商、智能设备提供商或系统服务提供商。</b></div>
                <div>当第三方软件、设备系统与艾侗游产品或服务结合为您提供服务时，艾侗游可能会基于您的授权及设定，收取您的信息并提供给系统，特殊情境下会包含您另行填写的联系信息。如您拒绝此类信息收集及使用，您需要在设备系统中进行设置或关闭提供服务的软件，艾侗游中无法自动或手动设置关闭相关服务。</div>
                <div><b>2） 生活服务平台或服务提供商。</b></div>
                <div>艾侗游接入了丰富的第三方生活服务。当您选择使用该第三方生活服务时，您授权我们将该信息提供给第三方生活服务平台或服务提供商，以便其基于相关信息为您提供服务。</div>
                <div><b>3） 广告服务商。</b></div>
                <div>未经您授权，我们不会将您的个人信息与提供广告服务商共享。但我们可能会将您的匿名化的用户画像与广告服务商共享，以帮助其在不识别您个人的前提下提升广告有效触达率。</div>
                <div>4. 对我们与之共享个人信息的公司、组织和个人，我们会对其数据安全环境进行调查，与其签署严格的保密协定，要求他们按照我们的说明、本隐私政策以及其他任何相关的保密和安全措施来处理个人信息。</div>
                <div>5. 我们不会将您的个人信息转让给除<b>艾侗游及其关联公司</b>外的任何公司、组织和个人，但以下情况除外：</div>
                <div>1）事先获得您的明确授权或同意；</div>
                <div>2）满足法律法规、法律程序的要求或强制性的政府要求或司法裁定；</div>
                <div>3）如果我们或我们的关联公司涉及合并、分立、清算、资产或业务的收购或出售等交易，您的个人信息有可能作为此类交易的一部分而被转移，我们将确保该等信息在转移时的机密性，并尽最大可能确保新的持有您个人信息的公司、组织继续受此隐私政策的约束，否则我们将要求该公司、组织重新向您征求授权同意。</div>
                <div>6. 我们仅会在以下情况下，公开披露您的个人信息：</div>
                <div>1）获得您的明确同意；</div>
                <div>2）基于法律法规、法律程序、诉讼或政府主管部门强制性要求下。</div>
                <div><b>7. 您主动与他人共享的信息</b></div>
                <div>1） <b>艾侗游的成长离不开等各方用户达人的共同努力。我们非常感谢您对艾侗游数据更新、情报反馈方面的贡献。</b>您可以通过艾侗游进行报错、新增、问题上报、评价等，以帮助更多的艾侗游用户享受到更精准的信息。</div>
                <div>2） 您可以利用艾侗游的分享功能与您手机通讯录中的联系人、您的特定或不特定社交好友（如微信、微博）共享您的个人信息。<b>请您在分享前充分考虑信息接收人的信誉情况，并建议您查看您利用的社交网络或第三方服务提供商的隐私声明，以了解他们如何处理您的信息，</b>以便审慎决策。</div>
                <div>8. 共享、转让、公开披露个人信息时事先征得授权同意的例外</div>
                <div>在以下情形中，共享、转让、公开披露个人信息无需事先征得个人信息主体的授权同意：</div>
                <div>1） 与国家安全、国防安全直接相关的；</div>
                <div>2） 与公共安全、公共卫生、重大公共利益直接相关的；</div>
                <div>3） 与犯罪侦查、起诉、审判和判决执行等直接相关的；</div>
                <div>4） 出于维护个人信息主体或其他个人的生命、财产等重大合法权益但又很难得到本人同意的；个人信息主体自行向社会公众公开的个人信息；从合法公开披露的信息中收集个人信息的，如合法的新闻报道、政府信息公开等渠道。</div>
            </div>

            <div>
                <div><h3>四、我们如何保存及保护您的个人信息</h3></div>
                <div><b>1. 保存期限。</b></div>
                <div>您在使用艾侗游产品及服务期间，我们将持续为您保存您的个人信息。如果您注销帐户或主动删除上述信息，艾侗游将依据网络安全法等法律法规规定在您删除后6个月内继续保存您的信息，在此期间我们不会再对您的个人信息进行商业化使用。</div>
                <div><b>2. 保存地域。</b></div>
                <div>您的个人信息均储存于中华人民共和国境内，如需跨境传输，我们将会单独征得您的授权同意。</div>
                <div><b>3. 安全措施。</b></div>
                <div>1）我们会以“最小化”原则收集、使用、存储和传输用户信息，并通过用户协议和隐私政策告知您相关信息的使用目的和范围。</div>
                <div>2）我们非常重视信息安全。我们成立了专责团队负责研发和应用多种安全技术和程序等，我们会对安全管理负责人和关键安全岗位的人员进行安全背景审查，我们建立了完善的信息安全管理制度和内部安全事件处置机制等。我们会采取适当的符合业界标准的安全措施和技术手段存储和保护您的个人信息，以防止您的信息丢失、遭到被未经授权的访问、公开披露、使用、毁损、丢失或泄漏。我们会采取一切合理可行的措施，保护您的个人信息。我们会使用加密技术确保数据的保密性；我们会使用受信赖的保护机制防止数据遭到恶意攻击。</div>
                <div>3）我们会对员工进行数据安全的意识培养和安全能力的培训和考核，加强员工对于保护个人信息重要性的认识。我们会对处理个人信息的员工进行身份认证及权限控制，并会与接触您个人信息的员工、合作伙伴签署保密协议，明确岗位职责及行为准则，确保只有授权人员才可访问个人信息。<b>若有违反保密协议的行为，会被立即终止与艾侗游的合作关系，</b>并会被追究相关法律责任，对接触个人信息人员在离岗时也提出了保密要求。</div>
                <div>4）我们提醒您注意，互联网并非绝对安全的环境，<b>当您通过艾侗游中嵌入的第三方社交软件、电子邮件、短信等与其他用户交互您的个人信息时，不确定第三方软件对信息的传递是否完全加密，注意确保您个人信息的安全。</b></div>
                <div>5）我们也请您理解，在互联网行业由于技术的限制和飞速发展以及可能存在的各种恶意攻击手段，即便我们竭尽所能加强安全措施，也不可能始终保证信息的百分之百安全。<b>请您了解，您使用我们的产品和/或服务时所用的系统和通讯网络，有可能在我们控制之外的其他环节而出现安全问题。</b></div>
                <div>6）<b>根据我们的安全管理制度，个人信息泄露、毁损或丢失事件被列为最特大安全事件，一经发生将启动公司最高级别的紧急预案，</b>由安全部、政府关系部、法务部等多个部门组成联合应急响应小组处理。</div>
                <div><b>4. 安全事件通知。</b></div>
                <div>1） 我们会制定网络安全事件应急预案，及时处置系统漏洞、计算机病毒、网络攻击、网络侵入等安全风险，在发生危害网络安全的事件时，我们会立即启动应急预案，采取相应的补救措施，并按照规定向有关主管部门报告。</div>
                <div>2） 个人信息泄露、毁损、丢失属于公司级特大安全事件，我们会负责定期组织工作组成员进行安全预案演练，防止此类安全事件发生。若一旦不幸发生，我们将按照最高优先级启动应急预案，组成紧急应急小组，在最短时间内追溯原因并减少损失。</div>
                <div>3） 在不幸发生个人信息安全事件后，我们将按照法律法规的要求，及时向您告知安全事件的基本情况和可能的影响、我们已采取或将要采取的处理措施、您可自主防范和降低的风险的建议、对您的补救措施等。我们将及时将事件相关情况以站内通知、短信通知、电话、邮件等您预留的联系方式告知您，难以逐一告知时我们会采取合理、有效的方式发布公告。同时，我们还将按照监管部门要求，主动上报个人信息安全事件的处置情况。</div>
            </div>

            <div>
                <div><h3>五、您的选择与权利</h3></div>
                <div><b>1. 人们有不同的隐私问题。我们的目标是清楚我们收集的信息，以便您可以对如何使用信息做出有意义的选择。例如，您可以：</b></div>
                <div>1） 使用艾侗游用户中心查看和控制与您的艾侗游帐户关联的某些类型的信息。</div>
                <div>2） 调整与艾侗游帐户关联的个人资料显示给其他人的方式。</div>
                <div>3） 您也可以将您的浏览器设置为阻止所有Cookie，包括与我们的服务相关的Cookie，或者指示何时由我们设置cookie。但是，请务必记住，如果您的Cookie被禁用，我们的许多服务可能无法正常运行。</div>
                <div><b>2. 按照中国相关的法律、法规、标准，以及其他国家、地区的通行做法，我们保障您对自己的个人信息行使以下权利：</b></div>
                <div>1）<b>更正权。</b></div>
                <div>当您发现我们处理的关于您的个人信息有错误时，经对您的身份进行验证，且更正不影响信息的客观性和准确性的情况下，您有权对错误或不完整的信息作出更正或更新，您可以自行在艾侗游用户中心内进行更正，或通过反馈与报错等将您的更正申请提交给我们。</div>
                <div>2）<b>删除权。</b></div>
                <div><b>在以下情形中，您可以向我们提出删除个人信息的请求：</b>如果我们终止艾侗游的产品运营及服务；如果您注销了帐号，我们会删除您的个人信息或做匿名化处理。<br>如果我们违法法律法规或与您的约定收集、使用、与他人共享或转让您的个人信息，您有权要求我们及第三方删除。<br>如果我们违反法律法规规定或与您的约定，公开披露您的个人信息，您有权要求我们立即停止公开披露的行为，并发布通知要求相关接收方删除相应的信息。<br>如果我们决定响应您的删除请求，我们还将同时通知从我们获得您的个人信息的实体，要求其及时删除，除非法律法规另有规定，或这些实体获得您的独立授权。<br>当您从我们的服务中删除信息后，我们可能不会立即备份系统中删除相应的信息，但会在备份更新时删除这些信息。</div>
                <div></div>
                <div></div>
                <div>3）<b>注销权。</b></div>
                <div>您随时可注销此前注册的账户。一旦您注销艾侗游账号，将无法使用艾侗游全线用户产品的服务，因此请您谨慎操作。我们为了保护您或他人的合法权益会结合您对艾侗游各产品的使用情况判断是否支持您的注销请求。除法律法规另有规定外，注销帐号之后我们将停止为您提供产品和服务，并根据您的要求删除您的个人信息。在您主动注销账号时，我们将根据适用法律法规的要求尽快使其匿名或删除您的个人信息。</div>
                <div>4）<b>提前获知产品和服务停止运营权。</b></div>
                <div>艾侗游愿一直陪伴您，若因特殊原因导致艾侗游产品和服务被迫停止运营，我们将提前15日在产品或服务的主页面或站内信或向您发送电子邮件或其他合适的能触达您的方式通知您，并将停止对您个人信息的收集，同时会按照法律规定对所持有的您的个人信息进行删除或匿名化处理等。<b>为保障安全，您可能需要提供书面请求，或以其他方式证明您的身份。</b>我们可能会先要求您验证自己的身份，然后再处理您的请求。我们将在三十天内做出答复。如您不满意，还可以通过以下途径投诉：service@aetosgo.com对于您合理的请求，我们原则上不收取费用，但对多次重复、超出合理限度的请求，我们将视情收取一定成本费用。对于那些无端重复、需要过多技术手段（例如，需要开发新系统或从根本上改变现行惯例）、给他人合法权益带来风险或者非常不切实际（例如，涉及备份磁带上存放的信息）的请求，我们可能会予以拒绝。</div>
                <div>5）<b>在以下情形中，按照法律法规要求，我们将无法响应您的更正、删除、注销信息的请求：</b></div>
                <div>
                    <p>(1) 与国家安全、国防安全直接相关的；</p>
                    <p>(2) 与公共安全、公共卫生、重大公共利益直接相关的；</p>
                    <p>(3) 与犯罪侦查、起诉、审判和执行判决等直接相关的；</p>
                    <p>(4) 我们有充分证据表明您存在主观恶意或滥用权利的（如您的请求将危害公共安全和其他人合法权益，或您的请求超出了一般技术手段和商业成本可覆盖的范围）；</p>
                    <p>(5) 响应个人信息主体的请求将导致您或其他个人、组织的合法权益受到严重损害的；</p>
                    <p>(6) 涉及商业秘密的。</p>
                </div>
            </div>

            <div>
                <div><h3>六、我们如何处理儿童的个人信息</h3></div>
                <div>艾侗游非常重视对未成年人信息的保护。</div>
                <div>我们的产品、网站和服务主要面向成人。如果没有父母或监护人的同意，儿童不得创建自己的用户账户。对于经父母同意而收集儿童个人信息的情况，我们只会在受到法律允许、父母或监护人明确同意或者保护儿童所必要的情况下使用或公开披露此信息。</div>
                <div>尽管当地法律和习俗对儿童的定义不同，但我们将不满 14 周岁的任何人均视为儿童。如果我们发现自己在未事先获得可证实的父母同意的情况下收集了儿童的个人信息，则会设法尽快删除相关数据。</div>
                <div>若您是14周岁以下的未成年人，建议您请您的监护人仔细阅读本隐私政策，<b>并在征得您的监护人同意的前提下使用我们的产品和/或服务或向我们提供信息。</b></div>
            </div>

            <div>
                <div><h3>七、您的个人信息如何在全球范围转移</h3></div>
                <div>原则上，我们在中华人民共和国境内收集和产生的个人信息，将存储在中华人民共和国境内。</div>
                <div>由于我们通过遍布全球的资源和服务器提供产品或服务，这意味着，在获得您的授权同意后，您的个人信息可能会被转移到您使用产品或服务所在国家/地区的境外管辖区，或者受到来自这些管辖区的访问。</div>
                <div>此类管辖区可能设有不同的数据保护法，甚至未设立相关法律。在此类情况下，我们会确保您的个人信息得到在中华人民共和国境内足够同等的保护。例如，我们会请求您对跨境转移个人信息的同意，或者在跨境数据转移之前实施数据去标识化等安全举措。</div>
            </div>

            <div>
                <div><h3>八、隐私政策的更新</h3></div>
                <div>如果您选择使用艾侗游服务，即表示您的访问以及任何有关隐私的争议均受本政策的约束。如果您有任何关于艾侗游隐私的问题，请通过详细的描述与我们联系，我们将尽力解决。</div>
                <div>我们的业务不断变化，我们的隐私政策也会更新。但是，未经您明确同意，我们不会削减您按照本隐私政策所应享有的权利。我们会在本页面上发布对本隐私政策所做的任何变更。</div>
                <div>对于重大变更，<b>我们会在产品或服务的主要曝光页面或站内信或向您发送电子邮件或其他合适的能触达您的方式通知您。</b>若您不同意该等变更可以停止使用艾侗游产品和服务，若您继续使用我们的产品和/或服务，即表示您同意受修订后的本隐私政策的约束。</div>
                <div><b>本政策所指的重大变更包括但不限于：</b></div>
                <div>
                    <p>(1) 我们的服务模式发生重大变化。如处理个人信息的目的、处理的个人信息类型、个人信息的使用方式等；</p>
                    <p>(2) 我们在所有权结构、组织架构等方面发生重大变化。如业务调整、破产并购等引起的所有者变更等；</p>
                    <p>(3) 个人信息共享、转让或公开披露的主要对象发生变化；</p>
                    <p>(4) 您参与个人信息处理方面的权利及其行使方式发生重大变化；</p>
                    <p>(5) 我们负责处理个人信息安全的责任部门、联络方式及投诉渠道发生变化时；</p>
                    <p>(6) 个人信息安全影响评估报告表明存在高风险时。</p>
                </div>
                <div>我们还会将本政策的旧版本存档，供您查阅。</div>
                <div>如有本隐私政策未尽事宜，以《艾侗游隐私权保护声明》为准。</div>
            </div>

            <div>
                <div><h3>九、投诉处理</h3></div>
                <div>1.您对艾侗游及本隐私政策有任何意见或建议发送邮件至service@aetosgo.com。</div>
                <div>2.关于本用户服务条款的问题，您可以通过如下联络方式同我们联系：中国上海市徐汇区虹漕路68号锦和中心11E， 邮编200233。为保障我们高效处理您的问题并及时向您反馈，需要您提交身份证明、有效联系方式和书面请求及相关证据，我们会在验证您的身份处理您的请求。</div>
            </div>

            <div>
                <div><h3>十、附：名词解释</h3></div>
                <div>
                    <p>(1) <b>个人信息</b>是指以电子或者其他方式记录的能够单独或者与其他信息结合识别特定自然人身份或者反映特定自然人活动情况的各种信息。个人信息包括姓名、出生日期、身份证件号码、个人生物识别信息、住址、通信通讯联系方式、通信记录和内容、账号密码、财产信息、征信信息、行踪轨迹、住宿信息、健康生理信息、交易信息等。</p>
                    <p>(2) <b>个人敏感信息</b>是指一旦泄露、非法提供或滥用可能危害人身和财产安全，极易导致个人名誉、身心健康受到损害或歧视性待遇等的个人信息。个人敏感信息包括身份证件号码、个人生物识别信息、银行账号、通信记录和内容、财产信息、征信信息、行踪轨迹、住宿信息、健康生理信息、交易信息、14岁以下（含）儿童的个人信息等。</p>
                    <p>(3) <b>设备</b>是指可用于使用艾侗游产品和/或服务的装置，例如桌面设备、平板电脑或智能手机。</p>
                    <p>(4) <b>唯一设备标识符</b>是指具有唯一性的设备标识符（有时称为通用专属 ID 或 UUID）是指由设备制造商编入到设备中的一串字符，可用于以独有方式标识相应设备（例如国际移动设备身份码IMEI号、网络设备硬件地址MAC）。不同的设备标识符在有效期、用户是否可以重置以及获取方式方面会有所不同。相应设备可能会有多个不同的具有唯一性的设备标识符。唯一设备标识符可用于多种用途，其中包括安全性和欺诈检测、同步服务（如用户的电子邮件收件箱）、记录用户的偏好设置以及提供具有相关性的广告。</p>
                    <p>(5) <b>Cookie</b>是指支持服务器端（或者脚本）在客户端上存储和检索信息的一种机制，通过增加简单、持续的客户端状态来扩展基于Web的客户端/服务器应用。服务器在向客户端返回HTTP对象的同时发送一条状态信息，并由客户端保存。状态信息中说明了该状态下有效的URL范围。此后，客户端发起的该范围内的HTTP请求都将把该状态信息的当前值从客户端返回给服务器，这个状态信息被称为Cookie。</p>
                    <p>(6) <b>匿名标示符</b>是指艾侗游基于设备参数，通过机器算法，生成一个标示符例如BAIDUID、CUID，帮助艾侗游识别一个用户，为其提供更好的产品和/或服务与改善用户体验。</p>
                    <p>(7) <b>用户画像</b>是指通过收集、汇聚、分析个人信息，对某特定自然人个人特征，如其职业、经济、健康、教育、个人喜好、信用、行为等方面做出分析或预测，形成其个人特征模型的过程。直接使用特定自然人的个人信息，形成该自然人的特征模型，称为直接用户画像。使用来源于特定自然人以外的个人信息，如其所在群体的数据，形成该自然人的特征模型，称为间接用户画像。</p>
                    <p>(8) <b>匿名化</b>是指通过对个人信息的技术处理，使得个人信息主体无法被识别，且处理后的信息不能被复原的过程。个人信息经匿名化处理后所得的信息不属于个人信息。</p>
                    <p>(9) <b>关联公司</b>是指艾侗游的经营者上海艾侗游科技有限公司及其他与艾侗游存在关联关系的公司的单称或合称。“关联关系”是指对于任何主体（包括个人、公司、合伙企业、组织或其他任何实体）而言，即其直接或间接控制的主体，或直接或间接控制其的主体，或直接或间接与其受同一主体控制的主体。前述“控制”指，通过持有表决权、合约或其他方式，直接或间接地拥有对相关主体的管理和决策作出指示或责成他人作出指示的权力或事实上构成实际控制的其他关系。</p>
                </div>
                <div><b>再次感谢您对艾侗游的信任和使用！</b></div>
                <div style="text-align:right;margin-top:50px"><p>上海艾侗游科技有限公司</p><p>2018年08月30日生效</p></div>
            </div>

            


        </div>

        <div v-show=" channelNav == 3 " class="channel_nav2"  style="padding-top:-40px">
            <div>
                <div><b>请您务必认真阅读本用户协议，本协议适用于您通过任何方式对艾侗游智能导游音箱（以下简称：艾侗游）各项服务的访问和使用，使用艾侗游，即表示您同意受本协议约束。如果您或您的监护人不同意本协议的任何内容，您应该立即停止使用艾侗游服务。</b></div>
                <div><h3>一、艾侗游用户协议</h3></div>
                <div>欢迎您使用艾侗游服务和产品。艾侗游是一款具备多种功能、软硬结合及云服务的智能旅游出行单品。硬件部分除了具备音箱外放功能外，还具备了高保真扩音、GPS、北斗、双频Wi-Fi（支持2.4G/5G）、4G网络、蓝牙4.1、照明和一键快速救助等多种功能；软件方面，具备了无线讲解，安全定位、用户管理、创建游团、行程安排、导游信息查询、评价系统、智能翻译（20多种语言）天气预报等出行所需功能。<b>用户可能通过不同方式使用艾侗游服务，包括艾侗游官方网站、包含艾侗游的APP应用、艾侗游的微信公众号、艾侗游的微博号等 （以下统称“艾侗游产品及服务”）。 艾侗游在不同场景下提供的服务不尽相同，取决于应用或设备的具体类型。</b></div>
                <div>本协议由艾侗游的版权人上海艾侗游科技有限公司与您（若使用者为自然人）或您所代表的实体（若使用者为法人）（以下简称“ 您 ”）订立，约束您对艾侗游的使用。<b>艾侗游特别提醒您在使用本服务之前认真阅读（未成年人应在法定监护人陪同下阅读）、充分理解本协议的全部条款，尤其是免责声明、投诉处理、管辖权等条款。</b>除非您接受本协议的全部条款，否则您无权注册、登录或使用本服务。您的注册、登录、使用等行为将视为您对本协议的接受，并视为您同意接受本协议各项条款的约束。</div>
                <div>您对本协议的接受包括接受艾侗游对本协议任何条款随时所做的任何修改。艾侗游有权随时修改本协议，更新后的协议将通过艾侗游 官方网站公布等适当的方式进行公布。一旦公布即代替原协议条款，恕不单独通知每位用户，请用户自行在艾侗游官方网站查阅最新版协议条款。如您不接受修改后的协议，请您立即停止使用本服务。您继续使用本服务将被视为您已接受了修改后的协议。</div>
            </div>

            <div>
                <div><h3>二、相关定义</h3></div>
                <div><b>1.用户：</b></div>
                <div>开发者面向的使用艾侗游服务和产品的所有网民。用户应当为具有完全民事行为能力的自然人，或者具有独立承担法律责任能力的其他合法主体。若用户属于无民事行为能力、限制民事行为能力人的，或是不具有独立承担法律责任能力的其他主体的，您应在监护人监护下进行交易或是得到有权主体授权后进行交易。</div>
                <div><b>2.艾侗游：</b></div>
                <div>是一款具备多种功能、软硬结合及云服务的智能旅游出行单品。可以在旅行途中为团游的游客提供安全、智能、整合的服务链条。</div>
            </div>

            <div>
                <div><h3>三、隐私政策</h3></div>
                <div>艾侗游非常重视对用户个人信息的保护。艾侗游将按照《艾侗游隐私政策》的规定收集、使用、储存和分享您的个人信息。《艾侗游隐私政策》为本协议不可分割的组成部分。</div>
            </div>

            <div>
                <div><h3>四、艾侗游服务条款</h3></div>
                <div>1.用户在使用艾侗游时，应遵守本协议及艾侗游的相关使用规则，遵守自愿、平等、公平及诚实信用原则，不利用艾侗游平台侵犯他人合法权益及谋取不正当利益，不扰乱网上交易的正常秩序。用户可以在艾侗游发布对商品或服务的购买体验、评价等信息，但不得在艾侗游平台发布包含以下内容的言论：</div>
                <div>
                    <p>1） 反对宪法所确定的基本原则，煽动、抗拒、破坏宪法和法律、行政法规实施的。</p>
                    <p>2） 煽动颠覆国家政权，推翻社会主义制度，煽动、分裂国家，破坏国家统一的。</p>
                    <p>3） 损害国家荣誉和利益的。</p>
                    <p>4） 煽动民族仇恨、民族歧视，破坏民族团结的。</p>
                    <p>5） 任何包含对种族、性别、宗教、地域内容等歧视的。</p>
                    <p>6） 捏造或者歪曲事实，散布谣言，扰乱社会秩序的。</p>
                    <p>7） 宣扬封建迷信、邪教、淫秽、色情、赌博、暴力、凶杀、恐怖、教唆犯罪的。</p>
                    <p>8） 公然侮辱他人或者捏造事实诽谤他人的，或者进行其他恶意攻击的。</p>
                    <p>9） 损害国家机关信誉的。</p>
                    <p>10） 其他违反宪法和法律行政法规的。</p>
                </div>
                <div>2.用户在艾侗游平台发布的信息，均代表用户的观点，与艾侗游无关，用户须对其言论独立承担完全的法律责任。用户在使用艾侗游提供的服务时，不得有下列行为：</div>
                <div>
                    <p>1）利用艾侗游平台从事洗钱、窃取商业秘密、窃取个人信息等违法犯罪活动。</p>
                    <p>2）将有关干扰、破坏或限制任何计算机软件、硬件或通讯设备功能的软件病毒或其他计算机代码、档案和程序之资料，加以上载、发布、发送电子邮件或以其他方式传送。</p>
                    <p>3）干扰艾侗游平台正常运行，非法入侵艾侗游服务器、篡改艾侗游代码或其他损害艾侗游系统的行为。</p>
                    <p>4）企图规避艾侗游平台的安全设置或网络系统，包括获取用户不应获取的数据，登录未经明确授权的服务器或帐户，或采用运行端口扫描等方式窥探其他网络的安全措施。</p>
                    <p>5）以导致艾侗游的计算机系统或设施承受不合理负载的方式获取艾侗游提供的服务或网站信息，或进行可能导致此类情况出现的行为。</p>
                    <p>6）实施任何形式的网络监控，从而截取与自身无关的信息。</p>
                    <p>7）利用艾侗游平台从事与艾侗游服务无关或不是以购物为目的的活动，试图扰乱正常购物秩序，谋取不正当利益的行为。</p>
                    <p>8）若用户提交的信息虚假、不准确等，导致艾侗游无法提供服务的，艾侗游有权暂停向该用户提供服务，直至用户提交正确的信息。</p>
                    <p>9）其他损害他人或艾侗游合法权益的行为。</p>
                </div>
                <div>3.一经发现用户提供虚假信息或有上述禁止的言论或行为的，艾侗游有权采取暂停提供服务、删除违法违规信息、限制用户购买、禁止用户发言、锁定用户帐户等处理措施。若因用户的上述言论或行为给他人或艾侗游造成损失的，用户还应承担赔偿责任。</div>
                <div>4.艾侗游通过技术检测、人工抽检等检测方式合理怀疑用户提供的信息错误、不实、失效或不完整时，有权通知用户更正、更新信息或中止、终止为其提供艾侗游服务。</div>
                <div>5.艾侗游有权在发现艾侗游上显示的任何信息存在明显错误时，对信息予以更正。</div>
                <div>6.艾侗游保留修改、中止或终止艾侗游服务的权利，艾侗游行使前述权利将按照法律规定的程序及方式告知用户。</div>
                <div>7.若国家相关机关向艾侗游发出命令、指示、裁决等法律文书或第三人向艾侗游投诉并提供相关证据材料，要求冻结、关闭用户帐号及交易的，艾侗游有权对相关帐号及交易进行冻结或取消，同时对违反本协议及艾侗游相关服务规则的用户，艾侗游有权封停其帐号。艾侗游采取上述措施的，将通过用户注册时提交的联系信息通知用户。</div>
                <div>8.用户应遵守本协议及艾侗游公示的各项服务规则的内容，若因用户违反本协议及服务规则造成损失的，用户应予以赔偿。</div>
            </div>

            <div>
                <div><h3>五、艾侗游接入的第三方功能及服务说明</h3></div>
                <div>1.为了更好的用户体验，艾侗游产品或服务中可能包含由艾侗游的关联方或第三方提供的功能及服务，也可能包含指向第三方网络站点以及第三方内容的链接。艾侗游可能为了用户便利操作而在产品或服务中提供相关功能模块，提供第三方功能及服务的使用入口。</div>
                <div>2.预置于艾侗游产品或服务中的第三方功能及服务，或是由用户自行开通或订购的第三方功能及服务，用户均理解并同意：</div>
                <div>
                    <p>1）本协议的签署并不意味着艾侗游成为用户与第三方功能及服务提供方之间交易的参与者，对前述交易艾侗游仅提供语音交互相关技术服务，艾侗游不对第三方功能及服务提供方和/或用户行为的合法性、有效性，以及第三方功能及服务的合法性、准确性、有效性、安全性进行任何明示或默示的保证或担保；</p>
                    <p>2）艾侗游并不监督第三方功能及服务，不对其拥有任何控制权，也不对第三方功能及服务提供任何形式的保证或担保，更不承担任何责任。艾侗游服务中预置的或指向第三方的技能/服务并不表示艾侗游对该第三方功能及服务的推促、采纳或赞助或与之关联。艾侗游不负责审查第三方功能及服务或与艾侗游服务链接的第三方网络站点的变更或更新及其质量、内容、政策、性质或可靠性。您一旦离开艾侗游服务站点，则本协议及相关政策将不再适用。您应当仔细审阅第三方相关条款与政策，包括但不限于第三方服务内容、有关隐私和数据采集、使用、共享的条款，并且在与第三方进行任何交易之前应当进行您认为必要或适当的背景调查。有些情况下，第三方功能及服务可能会要求您将您在艾侗游服务上的信息与您在第三方网站、站点或客户端上的信息相链接，您可以自行决定是否进行这种链接，但这种链接可能会随时被中断；</p>
                    <p>3） 用户如需使用第三方功能及服务，应另行与相应服务提供方达成协议或交易合约，支付相应费用（如果需要）；同时，用户应当遵循第三方功能及服务提供方的业务流程及业务规范，并对第三方功能及服务的合法性、准确性、有效性、安全性自行作出审慎判断并承担使用风险及后果；</p>
                    <p>4）用户与第三方功能及服务提供方之间发生的任何争议、纠纷应由用户与该方按照第三方功能及服务提供方的业务流程及业务规范自行协商解决，艾侗游不承担任何责任。</p>
                </div>
                <div>3.用户在使用艾侗游服务的同时使用第三方功能及服务的，用户同意授权艾侗游将用户使用服务的相关信息传递给该第三方，或从该第三方获取您注册或使用第三方服务时提供或产生的信息。</div>
                <div>4.为了维护用户权益，用户授权艾侗游协助解决其与第三方功能及服务提供方之间的相关争议、纠纷。艾侗游将努力进行协调，但艾侗游并不保证协调取得实际效果。</div>
            </div>

            <div>
                <div><h3>六、本协议如何更新与终止</h3></div>
                <div>艾侗游业务不断变化，用户协议也会更新。但是，未经您明确同意，我们不会削减您按照本隐私政策所应享有的权利。我们会在本页面上发布对本隐私政策所做的任何变更。对于重大变更，我们会在产品或服务的主要曝光页面或站内信或向您发送电子邮件或其他合适的能触达您的方式通知您。若您不同意该等变更可以停止使用艾侗游产品和服务，若您继续使用我们的产品和/或服务，即表示您同意受修订后的本用户协议的约束。</div>
                <div>本政策所指的重大变更包括但不限于：</div>
                <div>
                    <p>(1) 我们的服务模式发生重大变化。如处理个人信息的目的、处理的个人信息类型、个人信息的使用方式等；</p>
                    <p>(2) 我们在所有权结构、组织架构等方面发生重大变化。如业务调整、破产并购等引起的所有者变更等；</p>
                    <p>(3) 个人信息共享、转让或公开披露的主要对象发生变化；</p>
                    <p>(4) 您参与个人信息处理方面的权利及其行使方式发生重大变化；</p>
                    <p>(5) 我们负责处理个人信息安全的责任部门、联络方式及投诉渠道发生变化时；</p>
                    <p>(6) 个人信息安全影响评估报告表明存在高风险时。</p>
                </div>
                <div>我们还会将本政策的旧版本存档，供您查阅。</div>
            </div>

            <div>
                <div><h3>七、服务的中断和终止</h3></div>
                <div>1.艾侗游会尽全力维护平台的正常运行，以向用户提供持续、稳定、安全、顺畅的服务。但用户理解并同意：艾侗游对服务页面进行改版、升级网站系统、增加服务功能等须中断服务的操作时，有权暂时中断服务。艾侗游将尽可能在实施以上行为时予以提前公告，并尽可能将影响降低到最小。</div>
                <div>2.用户可自行停止使用艾侗游提供的服务，并可向艾侗游提交申请，要求封停或注销其帐户。用户帐户被封停或注销后，用户将不能使用艾侗游平台除浏览页面外的所有服务，但艾侗游仍有权保留用户的所有注册信息及过往交易记录，对用户在艾侗游平台从事违法行为或违反本协议及相关规定的行为，艾侗游仍有权行使本协议规定的权利并追究用户的法律责任。</div>
                <div>3.艾侗游可在下列情况下，自行停止向用户提供服务，并封停或注销其帐户，若因用户行为给艾侗游造成损失的，用户还应负责赔偿：</div>
                <div>
                    <p>1）用户违反本协议相关规定的，不论用户是否直接、间接或者通过他人再次注册成为艾侗游用户，艾侗游均有权停止向其提供服务。</p>
                    <p>2）用户使用虚假信息注册的，包括但不限于使用虚假姓名、虚假地址、虚假手机号、虚假电子邮箱等，艾侗游均有权立即停止向其提供服务。</p>
                    <p>3）本协议终止或更新时，用户明示不同意接受新协议的。</p>
                    <p>4）其他违反艾侗游相关规定或致使艾侗游或他人遭受利益损害的行为。</p>
                </div>
            </div>

            <div>
                <div><h3>八、知识产权</h3></div>
                <div>艾侗游高度重视知识产权保护，并遵守相关国家或地区的知识产权法律、法规和具有约束力的规范性文件。艾侗游上所有信息，包括但不限于艾侗游使用的所有商标、标识、文字、图片、音频、视频、程序的全部内容，艾侗游布局、网页设计、艾侗游架构及资料编辑、使用软件或程序，及其知识产权均属于艾侗游独立拥有、与相关内容之权利人共同拥有或经权利人授权使用。除非法律另有规定，未经艾侗游书面授权，对艾侗游拥有版权和其他知识产权的任何内容，任何人不得擅自以任何形式复制、编辑、传播、汇编、修改、下载、模仿、抄袭、重新发布、镜像、进行还原工程、解编或反向组译，否则艾侗游将依法追究法律责任。任何第三方在合理使用限度内转载本服务相关内容的，必须标明转载内容的出处、原作者、链接，并不得删除艾侗游版权标志（如有），否则艾侗游将保留追究其法律责任的权利。</div>
            </div>

            <div>
                <div><h3>九、违约责任</h3></div>
                <div>1.艾侗游或用户违反本协议的约定即构成违约，违约方应当向守约方承担违约责任。如因用户提供的信息不真实、不完整或不准确给艾侗游或商户造成损失的，艾侗游有权要求用户对艾侗游或对商户进行损失的赔偿。</div>
                <div>2.如因用户违反法律法规规定或本协议约定，在艾侗游或利用艾侗游服务从事非法活动的，艾侗游有权立即终止继续对其提供艾侗游服务，注销其账号，并要求其赔偿由此给艾侗游造成的损失。</div>
                <div>3.如用户以技术手段干扰艾侗游的运行或干扰其他用户对艾侗游使用的，艾侗游有权要求其赔偿由此给艾侗游造成的损失。</div>
            </div>

            <div>
                <div><h3>十、免责声明</h3></div>
                <div>1.因以下情况造成艾侗游服务在合理时间内的中断，艾侗游无需为此承担任何责任：</div>
                <div>
                    <p>1） 艾侗游需要定期或不定期地对提供艾侗游服务的平台或相关的设备进行检修或者维护，艾侗游保留不经事先通知为维修保养、升级或其它目的暂停本服务任何部分的权利；</p>
                    <p>2） 因台风、地震、洪水、雷电或恐怖袭击等不可抗力原因；</p>
                    <p>3） 用户的电脑软硬件和通信线路、供电线路出现故障的；</p>
                    <p>4） 因病毒、木马、恶意程序攻击、网络拥堵、系统不稳定、系统或设备故障、通讯故障、电力故障、银行原因、第三方服务瑕疵或政府行为等原因。</p>
                    <p>尽管有前款约定，艾侗游将采取合理行动积极促使艾侗游服务恢复正常。</p>
                </div>
                <div>2.用户明确同意其使用艾侗游服务所存在的风险将完全由其自己承担。用户理解并接受通过艾侗游服务取得的任何信息资料取决于用户自己，并由其承担系统受损、资料丢失以及其它任何风险。艾侗游服务所提供的信息资料仅供用户参考使用，不代表艾侗游同意其说法或描述，也不构成任何领域方面的专业建议。艾侗游不对用户通过艾侗游服务获得的信息内容的合法性、真实性、准确性、有效性做任何保证。</div>
                <div>3.在任何情况下，艾侗游均不对源于、基于或因本协议或用户使用艾侗游服务而导致的数据的丢失、泄露和/或任何损害赔偿负责，包括但不限于非直接的、间接的、特殊的、附带性的或惩罚性的损害赔偿或其他任何形式的损害赔偿，即使艾侗游已被告知此等损害赔偿的可能性。</div>
            </div>

            <div>
                <div><h3>十一、投诉处理</h3></div>
                <div><b>当您通过艾侗游使用第三方产品和服务时由第三方提供并承担相关法律责任，我们仅负责提供自动接入、自动传输、信息存储空间、搜索、链接或文件分享技术等网络服务，不对其服务或内容进行任何形式的审查，也不做任何编辑或修改。根据中华人民共和国法律、法规要求，艾侗游制定了旨在保护权利人的合法权益的措施和步骤，具体如下：</b></div>
                <div>1.权利通知： 如权利人认为在艾侗游中由第三方所提供的服务、内容或者链接可能侵犯其合法权益时，权利人应当向艾侗游提交书面的权利通知，该权利通知应当包含以下内容：</div>
                <div>
                    <p>1）权利人的具体信息，包括姓名（名称）、通信地址、电子邮箱、电话号码、有效的身份证明文件（如居民身份证、护照、营业执照等）复印件；</p>
                    <p>2）要求终止、删除或者断开链接的侵权服务或内容（以下简称“涉嫌侵权内容”）的名称和网络地址；</p>
                    <p>3）涉嫌侵权内容构成侵权的初步证明材料，包括但不限于权利人对涉嫌侵权内容拥有合法权利的权属证明文件、涉嫌侵权事实说明。权利通知需由权利人或其授权人签名，如权利人为法人或其他组织则需加盖公章。权利人应当对其发出的权利通知的真实性负责，并自行承担由此产生的全部法律责任。艾侗游在收到权利通知后，将在合理期限内进行形式审查，如该权利通知符合前述要求的，艾侗游将根据法律法规之规定删除涉嫌侵权内容或断开涉嫌侵权链接。同时，艾侗游有权根据审查之需要要求权利人提供进一步证明材料，权利人应予以配合。艾侗游依法删除被投诉内容或断开被投诉链接的同时，将权利通知转送该内容或者链接的提供方；如因该内容或者链接的提供方的地址不明而无法转送的，艾侗游则将该权利通知在网上进行公告。</p>
                </div>
                <div>2.反通知：涉嫌侵权内容提供方在收到艾侗游转送或在艾侗游公告页面获悉的权利通知后3个工作日内，认为涉嫌侵权内容并未侵犯他人权利的，可向艾侗游以书面形式提交反通知，要求恢复被删除内容或被断开的链接。反通知应当包含下列内容：</div>
                <div>
                    <p>1） 内容或链接提供方的具体信息，包括姓名(名称)、通信地址、电话号码、有效的身份证明文件 （如居民身份证、护照、营业执照等）；</p>
                    <p>2） 要求恢复的内容或链接对应的准确名称和网络地址；</p>
                    <p>3） 不构成侵权的初步证明材料，包括但不限于其对被删除或断开内容、链接享有合法权利的权属证明文件、不构成侵权情况说明等；反通知应由权利人或其合法授权人签名，若为单位则需加盖单位公章。服务对象应对反通知的真实性负责，并自行承担由此产生的全部法律责任。艾侗游收到连接或内容提供方提交的反通知后，将在合理期限内进行形式审查，如该反通知符合前述要求的，将立即恢复被删除的内容，或者恢复被断开的链接，同时将该反通知转送权利人。权利人对反通知的内容有异议的，应当立即通知艾侗游并提供反驳理由和证据，但不得以原来的权利通知中的同等理由或证据要求艾侗游删除该内容或断开该链接。</p>
                </div>
                <div>3.权利通知及反通知提交方式权利通知及反通知应通过以下方式向艾侗游提交：</div>
                <div>
                    <p>1）将扫描件发送至：service@aetosgo.com</p>
                    <p>2）并将书面材料邮寄至：中国上海市徐汇区虹漕路68号锦和中心11E，邮编200233。</p>
                </div>
                <div>为保障我们高效处理您的问题并及时向您反馈，需要您提交身份证明、有效联系方式和书面请求及相关证据，我们会在验证您的身份处理您的请求。 艾侗游删除或恢复内容、断开或恢复链接的行为均是依法进行，艾侗游对此不承担任何责任。</div>
            </div>

            <div>
                <div><h3>十二、法律管辖和适用</h3></div>
                <div><b>1.本协议的订立、执行和解释及争议的解决均应适用中华人民共和国大陆地区法律。</b></div>
                <div><b>2.因用户与艾侗游就本协议的签订、履行或解释发生争议，双方应努力友好协商解决。如协商不成，任何一方均有权向徐汇区人民法院或根据级别管辖的规定向其上级法院起诉。</b></div>
            </div>

            <div>
                <div><h3>十三、附则</h3></div>
                <div>本协议自用户确认接受之时起或自用户的使用行为发生之时起（以时间在先者为准）生效。</div>
                <div style="text-align:right;margin-top:50px"><p>上海艾侗游科技有限公司</p><p>2018年08月30日生效</p></div>
            </div>
        </div>

        <div v-show=" channelNav == 4 " class="channel_nav4">
            <div class="channel_nav1_img"><img src="https://ag-home.oss-cn-beijing.aliyuncs.com/imgs/banner09.png" alt=""></div>
            <div class="channel_nav1_title">客服咨询</div>
            <div class="channel_nav4_kefu">
                <div>
                    <div><img src="https://ag-home.oss-cn-beijing.aliyuncs.com/imgs/hotline.png" alt=""></div>
                    <div>
                        <div class="font_tit">购买咨询热线</div>
                        <div class="font_phone mt10">400-1131-939</div>
                        <div class="font_time mt30">服务时间 : 9:00 - 18:00</div>
                    </div>
                </div>
                <div style="border-left: 1px solid #ccc;height:100%"></div>
                <div>
                    <div><img src="https://ag-home.oss-cn-beijing.aliyuncs.com/imgs/customer_service.png" alt=""></div>
                    <div>
                        <div class="font_tit">在线人工咨询</div>
                        <div class="font_time mt12">服务时间 : 9:00 - 23:00</div>
                        <div class="mt16">
                            <el-button style="background:#FF6E2C">
                                <a target="_blank" style="color:#fff;text-decoration:none" href="http://wpa.qq.com/msgrd?v=3&uin=2125218337&site=qq&menu=yes">立即咨询</a>
                            </el-button>
                        </div>
                    </div>
                </div>
            </div>
            <div style="border-top:1px solid #ccc"></div>
            <div class="channel_nav1_title">投诉建议</div>
            <div class="channel_nav4_suggest">
                <div style="padding-bottom:30px;">可在此直接填写提交您的投诉及建议</div>
                <div class="">
                    <div class="w300"> *姓名：</div><el-input maxlength="10" v-model="suggest.name" style="margin-right:3%" placeholder="必填项"></el-input>
                    <div class="w300"> *邮箱：</div><el-input v-model="suggest.email" style="margin-right:3%" placeholder="必填项"></el-input>
                    <div class="w300"> *电话：</div><el-input maxlength="11" v-model="suggest.phone" placeholder="必填项"></el-input>
                </div>
                <div >
                    <div class="w100">*标题：</div>
                    <el-input v-model="suggest.title" maxlength="50" placeholder="必填项"></el-input>
                </div>
                <div class="titxz">标题输入限制{{50-suggest.title.length}}个字符</div>
                <div style="align-items: flex-start" class="channel_nav4_textarea">
                    <div class="w100" style="margin-top:5px;">*内容：</div>
                    <el-input maxlength="500" v-model="suggest.content" type="textarea" ></el-input>
                </div>
                <div class="titxz" style="margin-top:22px">

                    <div class="vue-uploader">
                        <div class="file-list">
                            <section v-for="(file, index) of files" class="file-item draggable-item" :key="file.name">
                                <img :src="file.src" alt="" ondragstart="return false;">
                                <span class="file-remove" @click="remove(index)">+</span>
                            </section>
                            <section v-if="status == 'ready'" class="file-item">
                                <div @click="add" class="add"></div>
                            </section>
                        </div>
                        <section v-if="files.length != 0" class="upload-func">
                            <div class="progress-bar">
                                <section v-if="uploading" :width="(percent * 100) + '%'">{{(percent * 100) + '%'}}</section>
                            </div>
                        </section>
                        <input type="file" @change="fileChanged" ref="file" multiple="multiple" accept="image/jpg,image/jpeg,image/png,image/bmp">
                    </div>

                </div>
                <div class="titxz"  style="margin-top:2px">允许图片类型：PNG、JPG、GIF，且不超过3.5MB</div>
                <div><el-button  @click="suggestBtn" type="primary" style="padding:15px 69px;margin:30px auto">意见提交</el-button></div>
            </div>
            <div class="channel_nav1_title">艾侗游售后服务总则</div>
            <div>
                <el-table
                    :data="tableData"
                    border
                    >
                    <el-table-column
                    prop="title"
                    center="true"
                    label="服务名称"
                    width=""
                    align="center">
                    </el-table-column>
                    <el-table-column
                    prop="content"
                    label="具体内容及条件"
                    width="">
                    </el-table-column>
                </el-table>
            </div>
            <div style="margin:80px 0 40px 0;color:#333">艾侗游承诺符合以下情况，自客户收到商品次日起7日内可以无理由退货，15日内因质量问题可以换货，客户可在线提交返修申请办理退换货事宜。具体退换货标准如下：</div>
            <div>
                <el-table :data="tableData1" border style="width: 100%">
                    <el-table-column prop="title" center="true" label="退换类别" align="center"></el-table-column>
                    <el-table-column prop="content" center="true" label="具体描述" align="center"></el-table-column>
                    <el-table-column prop="return7" center="true" label="是否支持7天（含）内退换货" align="center"></el-table-column>
                    <el-table-column prop="return15" center="true" label="是否支持15天（含）内退换货" align="center"></el-table-column>
                    <el-table-column prop="freight" center="true" label="是否收取返回运费" align="center"></el-table-column>
                    <el-table-column prop="remark" center="true" label="备注" align="center"></el-table-column>
                </el-table>
            </div>
            <div style="margin:80px 0 40px 0;color:#333;font-size:18px">七日无理由退货特殊说明</div>
            <div class="channel_nav4_tst">
                <p>1、客户接收商品之日为签收日期；如果签收日期不明确的，以第三方物流平台显示的实际到货日期为准。</p>
                <p>2、以下情况不予办理退货：</p>
                    <div>&nbsp;&nbsp; （1）对商品进行未经授权的维修、改动，破坏、涂改强制性产品认证标志、指示标贴等，有难以恢复原状的外观类使用痕迹；</div>
                    <div>&nbsp;&nbsp; （2）未在收到商品次日起7日内提出退货申请；</div>
                    <div>&nbsp;&nbsp; （3）在商品购买及详情页面明确约定不适用“7日无理由退货”政策的。</div>
                <p>3、退货运费由客户承担。请自付运费发快递至供货商的退货中心，不接受到付方式；若以到付方式返回，有可能会被拒收或认可从货款中扣除垫付的运费。</p>
                <p>4、客户退货时应当将商品本身、配件及赠品一并退回。赠品包括赠送的实物、积分、代金券、优惠券等形式。如果赠品不能一并退回，应按照标明的赠品价格支付赠品价款。</p>
                <p>5、办理退货时如无法提供已经开具的发票，需先补开发票后方能办理退货，补开发票所产生的全部额外费用均由客户承担。</p>
                <p>6、客户购买商品时采用信用卡支付方式并发生手续费的（无论该手续费是否在支付时由艾侗游免除），办理退货时该手续费由客户承担。    </p>
                <p>7、在满减优惠活动中的部分商品退货，导致不能再享受优惠的，根据购买时各商品价格进行结算，多退少补。</p>
                <p>8、以上各项由客户承担的费用可直接从需退还的货款中抵扣。</p>
            </div>
        </div>
    </div>



  </div>
</template>

<script>
import Axios from 'axios'
export default {
  name: 'channel',
  data () {
    return {
      channelNav: '',
      dialogFormVisible: false,
      changeFlag: false,
      //代理商申请
      form: {
          name: '',
          phone: '',
          path: '',
          capital: {city:'',cityid:''},  
          city: {city:'',cityid:''},
          town: {city:'',cityid:''},
          content: ''
      },
      capitalArr:[],
      cityArr: [],
      townArr: [],
      formLabelWidth: '15px',
      dialogImageUrl: '',
      dialogVisible: false,
      tableData:[
          {
            title: '7天无理由退货',
            content: '客户购买商品7日内（含7日，自客户收到商品次日起算），在保证商品完好，产品、赠\n品及附件齐全的前提下，可无理由退货；但部分商品除外，请您务必详细了解各商品细\n则并确认。\n\n注：（1）以上产品返回运费由买方承担；\n       （2）收货单据、附随保修卡、发票及赠品等需一并退回买方。'
          },
          {
            title: '质量问题换机',
            content: '客户购买商品（非选件产品）15日内（含15日，自客户收到商品次日起计算）因质量\n问题提交换货申请且审核通过，艾侗游提供免费换机服务。遇法定节假日或不可抗力的\n情形，卖方无需对不能行之行为承担责任。'
          }
      ],
      tableData1:[
          {
              title: '国家法律所规定的功能性\n故障或者商品质量问题',
              content: '由艾侗游售后服务中心检测\n确认，并出具检测报告确认\n属于商品质量问题',
              return7: '是',
              return15: '是',
              freight: '否',
              remark: '无'
          },
           {
              title: '到货物流损、缺件或商品描\n述与网站不符',
              content: '物流损指在运输过程中造成\n的损坏、破碎、性能故障，\n经售后人员核实情况属实。\n缺件指原装配件缺失',
              return7: '是',
              return15: '是',
              freight: '否',
              remark: '审核期间可能需要快递人员\n证明或要求您提供实物照片\n等，以便快速做出判断并及\n时处理'
          },
           {
              title: '其他原因',
              content: '除以上两种原因外，如个人\n原因导致的退换货，在商品\n完好，齐全的前提下',
              return7: '是',
              return15: '是',
              freight: '是',
              remark: '由您承担商品返回艾侗游的\n运费'
          }
      ],
      //投诉建议
      suggest:{
          name: '',
          email: '',
          phone: '',
          title: '',
          content: '',
          imgs: []
      },
      status: 'ready',
      files: [],
      point: {},
      uploading: false,
      percent: 0,
      fullscreenLoading: false
      
    }
  },
  watch:{
        '$route' (to,from){
         let typeD = to.query.type;
         this.channelNav = typeD;

        }
    },
  methods: {
        channelBtn(type){
            this.$router.push({
                path: '/channel',
                query:{
                    type:type
                }
            })
        },
        handleRemove(file, fileList) {
        console.log(file, fileList);
        },
        handlePictureCardPreview(file) {
            console.log(file)
        // this.dialogImageUrl = file.url;
        // this.dialogVisible = true;
        },
        showBtn(){
            let _that = this;
            _that.dialogFormVisible = true;
            _that.changeFlag = true;
            Axios.post(_that.hostUrl+'app/province')
            .then((res)=> {
                if(res.data.success === "00000000"){
                    _that.capitalArr = res.data.obj;
                }
            })
        },
        capitalBtn(city){
            let _that = this;
            for(let i in _that.capitalArr){
                if(city == _that.capitalArr[i].city){
                    let id = _that.capitalArr[i].cityid;
                    _that.form.capital.cityid = id;
                    Axios({
                        method: 'post',
                        url: _that.hostUrl+'app/lastlevel',
                        params:{cityid:id}})
                    .then((res)=> {
                        if(res.data.success === "00000000"){
                            if(res.data.obj.length>0){
                                _that.cityArr = res.data.obj;
                                _that.form.city = [];
                                _that.townArr.city = [];
                                _that.townArr = [];
                                _that.form.town = [];
                            }else{
                                _that.cityArr = [];
                                _that.townArr = [];
                                _that.form.city = [];
                                _that.form.town = [];
                            }
                        }
                    })
                }
            }
        },
        cityBtn(city){
            let _that = this;
            for(let i in _that.cityArr){
                console.log(_that.cityArr[i].city)
                if(city == _that.cityArr[i].city){
                    let id = _that.cityArr[i].cityid;
                    _that.form.city.cityid = id;
                    Axios({
                        method: 'post',
                        url: _that.hostUrl+'app/lastlevel',
                        params:{cityid:id}})
                    .then((res)=> {
                        if(res.data.success === "00000000"){
                            if(res.data.obj.length>0){
                                _that.townArr = res.data.obj;
                            }else{
                                _that.form.town = [];
                                _that.townArr = [];
                            }
                        }
                    })
                }
            }
        },
        townBtn(city){
            let _that = this;
            for(let i in _that.townArr){
                if(city == _that.townArr[i].city){
                let id = _that.townArr[i].cityid;
                _that.form.town.cityid = id;
                }
            }
        },
        informBtn(){
        console.log(this.form)
        let _that = this;
        let _thatData = _that.form;
        let myreg=/^[1][3,4,5,7,8][0-9]{9}$/;
        if(_thatData.name === ""){
            _that.$message({
                showClose: true,
                message: '您的姓名 不能为空',
                type: 'error'
            });
        }else if(_thatData.phone === ""){
            _that.$message({
                showClose: true,
                message: '您的联系方式 不能为空',
                type: 'error'
            });
        }else if(!myreg.test(_thatData.phone)){
            _that.$message({
                showClose: true,
                message: '您输入的手机有误',
                type: 'error'
            });
        }else if(_thatData.path === ""){
            _that.$message({
                showClose: true,
                message: '您的营业地址 不能为空',
                type: 'error'
            });
        }else if(_thatData.capital.city === ""){
            _that.$message({
                showClose: true,
                message: '请选择地址',
                type: 'error'
            });
        }else if(_thatData.content === ""){
            _that.$message({
                showClose: true,
                message: '您的留言 不能为空',
                type: 'error'
            });
        }else{
            Axios({
                method: 'post',
                url: _that.hostUrl+'agent/apply',
                params:{
                    name: _thatData.name,
                    phone: _thatData.phone,
                    content: _thatData.content,
                    addr: _thatData.path,
                    province: _thatData.capital.city,
                    provinceid: _thatData.capital.cityid,
                    city: _thatData.city.city,
                    cityid: _thatData.city.cityid,
                    area: _thatData.town.city,
                    areaid: _thatData.town.cityid
                }
            })
            .then((res)=>{
                console.log(res)
                if(res.data.success === "00000000"){
                    _that.$message.success(res.data.msg)
                    _that.dialogFormVisible = false;
                    _that.form= {
                        name: '',
                        phone: '',
                        path: '',
                        capital: {city:'',cityid:''},  
                        city: {city:'',cityid:''},
                        town: {city:'',cityid:''},
                        content: ''
                    }
                }
            })
            
        }
        },
        suggestBtn(){
            let _that = this;
            let myreg=/^[1][3,4,5,7,8][0-9]{9}$/;
            let nameReg = /^[a-zA-Z\u4e00-\u9fa5]+$/
            let emailExp = new RegExp("^[a-zA-Z0-9_.-]+@[a-zA-Z0-9-]+(\.[a-zA-Z0-9-]+)*\.[a-zA-Z0-9]{2,6}$");
            if(_that.suggest.name === ""){
                _that.$message({
                    showClose: true,
                    message: '您的姓名 不能为空',
                    type: 'error'
                });
            }else if(!nameReg.test(_that.suggest.name)){
                this.$message({
                    showClose: true,
                    message: '姓名只能输入汉字和字母',
                    type: 'error'
                });
            }else if(_that.suggest.email.length == ""){
                _that.$message({
                    showClose: true,
                    message: '您的邮箱 不能为空',
                    type: 'error'
                });
            }else if(!emailExp.test(_that.suggest.email)){
                _that.$message({
                    showClose: true,
                    message: '请输入正确的邮箱',
                    type: 'error'
                });
            }else if(_that.suggest.phone === ""){
                _that.$message({
                    showClose: true,
                    message: '您的联系方式 不能为空',
                    type: 'error'
                });
            }else if(!myreg.test(_that.suggest.phone)){
                _that.$message({
                    showClose: true,
                    message: '请输入正确的联系方式',
                    type: 'error'
                });
            }else if(_that.suggest.title === ""){
                _that.$message({
                    showClose: true,
                    message: '您的意见标题 不能为空',
                    type: 'error'
                });
            }else if(_that.suggest.content === ""){
                _that.$message({
                    showClose: true,
                    message: '您的意见描述 不能为空',
                    type: 'error'
                });
            }else if(_that.files.length<1){
                _that.successBtn()
            }
            else{
                // _that.openFullScreen2();
                _that.submit();
            }
        },
        successBtn(){
            let _that = this;
            // console.log(_that.suggest.imgs);
            // _that.$loading().close();
            if(_that.suggest.imgs.length>0){
                _that.suggest.imgs = JSON.stringify(_that.suggest.imgs);
            }else{
                _that.suggest.imgs = '';
            }
            Axios({
                    method: 'post',
                    url: _that.hostUrl+'freeback/issue',
                    params:{
                        name: _that.suggest.name,
                        email: _that.suggest.email,
                        phone: _that.suggest.phone,
                        title: _that.suggest.title,
                        content: _that.suggest.content,
                        imgs: _that.suggest.imgs
                    }
                })
                .then((res)=>{
                    console.log(res)
                    if(res.data.success === "00000000"){
                        _that.$message({
                            showClose: true,
                            message: res.data.msg,
                            type: 'success'
                        });
                        console.log(_that.suggest)
                        _that.suggest={
                            name: '',
                            email: '',
                            phone: '',
                            title: '',
                            content: '',
                            imgs: []
                        };
                        _that.files = [];
                        _that.suggest.name = '';
                        _that.suggest.email = '';
                        _that.suggest.phone = '';
                        _that.suggest.title = '';
                        _that.suggest.content = '';
                    }else{
                        _that.$message({
                            showClose: true,
                            message: res.data.msg,
                            type: 'error'
                        });
                    }
                })
                .catch((err)=>{
                    console.log(err.response);
                    _that.$message({
                        showClose: true,
                        message: '网络不给力，提交失败！',
                        type: 'error'
                    });
                })
        },
        addImg(){
            
        },
        add() {
                this.$refs.file.click()
            },
        submit() {
            var that=this
            that.suggest.imgs = []
            Axios.post(that.hostUrls+'anygo/common/ali_sts')
            .then((res)=>{
                // console.log(res);
                if(res.status == 200){
                    let OSSData = res.data;
                    const client = new OSS.Wrapper({
                        region: 'oss-cn-beijing',  
                        accessKeyId: OSSData.AccessKeyId,
                        accessKeySecret: OSSData.AccessKeySecret,
                        stsToken: OSSData.SecurityToken,
                        bucket: 'ag-home'
                    });
                    const fNum = that.files;
                    let imgLen = 0
                    let loadLen = 0
                    for(var i=0;i<fNum.length;i++){
                        var f=fNum[i].file
                        const Name=f.name
                        const suffix = Name.substr(Name.indexOf("."));
                        const obj=that.timestamp();
                        const storeAs = 'bsImg/'+obj+suffix  //  路径+时间戳+后缀名
                        loadLen++
                        client.multipartUpload(storeAs, f).then(function (result){
                            that.suggest.imgs.push({
                                content: '',
                                url: 'http://ag-home.oss-cn-beijing.aliyuncs.com/'+result.name
                            });
                            imgLen++
                            if(imgLen == loadLen){
                                that.successBtn();
                            }
                        })
                    }
                }else{

                }
            })
            .catch((err)=>{
                console.log(err);
                that.$message({
                    showClose: true,
                    message: '网络不给力，提交失败！',
                    type: 'error'
                });
            })
            // })
            // .then((val)=>{
            //     that.successBtn();
            // })

        },
        //  时间戳
        timestamp:function(){  
            const time = new Date();  
            const y = time.getFullYear();  
            const m = time.getMonth()+1;  
            const d = time.getDate();  
            const h = time.getHours();  
            const mm = time.getMinutes();  
            const s = time.getSeconds();  
            const ms = time.getMilliseconds()  
            return ""+y+this.Add0(m)+this.Add0(d)+this.Add0(h)+this.Add0(mm)+this.Add0(s)+this.Add0(ms);  
        },
        Add0:function(m){  
            return m<10?'0'+m : m;  
        } ,

        finished() {
            this.files = []
            this.status = 'ready'
            
        },
        remove(index) {
            this.files.splice(index, 1)
        },
        fileChanged() {
            const list = this.$refs.file.files;
            console.log(list)
            for (let i = 0; i < list.length; i++) {
                if (!this.isContain(list[i])) {
                    const item = {
                        name: list[i].name,
                        size: list[i].size,
                        file: list[i]
                    }
                    this.html5Reader(list[i], item)
                    this.files.push(item)
                }
            }
            this.$refs.file.value = ''
        },
        // 将图片文件转成BASE64格式
        html5Reader(file, item){
            const reader = new FileReader()
            reader.onload = (e) => {
                this.$set(item, 'src', e.target.result)
            }
            reader.readAsDataURL(file)
        },
        isContain(file) {
            return this.files.find((item) => item.name === file.name && item.size === file.size)
        },
        openFullScreen2() {
            const loading = this.$loading({
            lock: true,
            text: '意见提交中...',
            spinner: 'el-icon-loading',
            background: 'rgba(0, 0, 0, 0.7)'
            });
        }

  },
  mounted(){
      this.channelNav = this.$route.query.type;
      
  }
}
</script>

<style>
  @media (min-width: 2000px){
    .channel{
      width: 1920px !important;
    }
  }
  @keyframes opact {
      0% {
          opacity: 0;
      }
      100% {
          opacity: 1;
      }
  }
  .channel{
      background-color: #f3f3f3;
      min-width: 1200px;
      margin: 0 auto;
      padding: 20px 0 70px 0;
  }
  .channel_banner{
      background: #fff;
      width: 1200px;
      height: 116px;
      margin:0 auto;
      display: flex;
      align-items: center;

  }
  .channel_banner div{
      width: 146px;
      height: 30px;
      line-height: 30px;
      margin-left: 30px;
      text-align: center;
      background: #ccc;
      color: #fff;
      border-radius: 50px;
      cursor: pointer;
  }
  .channel_banner div:hover{
      background: rgba(204, 204, 204, .8);
  }
  .channel_banner div:active{
      background: rgba(204, 204, 204, .5);
  }
  .channer_active{
      background: #3b9cf8 !important;
  }
  .channer_none{
      background-color: #ccc;
  }
  .channel_nav_box{
      width: 1200px;
      margin: 0 auto;
  }
  .channel_nav_box>div{
      background-color: #fff;
      margin-top: 5px;
      padding: 40px 30px;
      animation: opact .5s;
  }
  .channel_nav1_img img{
      width: 100%;
      width: 100%;
  }
  .channel_nav1_title{
      text-align: center;
      padding: 80px 0;
      font-size: 30px;
      color: #333;
  }
  .channel_nav1_icon{
      width: 1140px;
      display: flex;
      justify-content: center;
      border-bottom: 1px solid #ccc;
      padding-bottom: 80px;
  }
  .channel_nav1_icon>div{
      margin-left: 106px;
  }
  .channel_nav1_icon>div:nth-child(1){
      margin-left: 0;
  }
  .channel_nav1_icon img{
      margin: 0 auto;
  }
  .channel_av1_text{
      padding-bottom: 60px;
      border-bottom: 1px solid #ccc;
  }
  .channel_av1_text p{
      color: #333;
      font-size: 14px;
      padding-bottom: 20px;
      line-height: 25px;
  }
  .channel_nav1_icon2{
      width: 1140px;
      display: flex;
      justify-content: space-between;
      flex-wrap: wrap;
      padding-bottom: 80px;
      border-bottom: 1px solid #ccc;
  }
  .channel_nav1_icon2_b div,.channel_nav1_icon2_t div{
      padding:50px 100px;
  }
  .rel_icon2{
      position: relative;
      width: 0;
      height: 0;
  }
  .icon2_abl1{
      position: absolute;
      left: 380px;
      width: 1px;
      height: 670px;
      background: #ccc;
  }
  .icon2_abl2{
      position: absolute;
      left: 760px;
      width: 1px;
      height: 670px;
      background: #ccc;
  }
  /* .bor_r{
      border-right: 1px solid #ccc;
  } */
  .channel_nav1_icon2_b{
      border-bottom: 1px solid #ccc;
      width: 1140px;
      display: flex;
      justify-content: space-around;
  }
  .channel_nav1_icon2_t{
      width: 1140px;
      display: flex;
      justify-content: space-around;
  }
  .channel_nav1_icon3{
      padding-bottom: 80px;
      border-bottom: 1px solid #ccc;
      display: flex;
      justify-content: space-around;
  }
  .channel_nav1_icon3 img{
      width: 280px;
  }
  .channel_nav1_icon4{
      padding-bottom: 80px;
      border-bottom: 1px solid #ccc;
  }
  .channel_nav1_icon5{
      text-align: center;
      padding-bottom: 60px;
  }
  .form_box{
      text-align: center;
  }
  .form_box_title{
      font-size: 30px;
      color: #333;
      padding-bottom: 60px;
  }
  .form_box_content{
      padding: 0 50px;
  }
  .channel_dialog textarea{
      height: 300px !important;
      resize: none;
  }
  .channel_nav4_kefu{
      display: flex;
      height: 200px;
      align-items: center;
      border: 1px solid #ccc;
      margin-bottom: 80px;
  }
  .channel_nav4_kefu>div{
      display: flex;
      justify-content: center;
  }
  .channel_nav4_kefu>div:nth-child(1),.channel_nav4_kefu>div:nth-child(3){
      width: 50%;
  }
  .channel_nav4_kefu>div>div:nth-child(1){
      margin-right: 40px;
      display: flex;
      align-items: center;
  }
  .font_tit{
      font-size: 18px;
      color: #333;
  }
  .font_phone{
      font-size: 30px;
      color: #3b9cf8;
  }
  .font_time{
      font-size: 16px;
      color: #999;
  }
  .mt10{
      margin-top: 10px;
  }
  .mt12{
      margin-top: 12px;
  }
  .mt16{
      margin-top: 16px;
  }
  .mt30{
      margin-top: 20px;
  }
  .channel_nav4_suggest{
      padding-bottom: 50px;
      border-bottom: 1px solid #ccc;
  }
  .channel_nav4_suggest>div{
      display: flex;
      align-items: center;
     padding-top: 30px;
     color: #333;
     font-size: 16px;
  }
  .w100{
      width: 75px;
  }
  .w300{
      width:300px;
  }
  .titxz{
      margin-left: 75px;
      padding-top: 8px !important;
      font-size: 12px !important;
      color: #aaa !important;
  }
  .channel_nav4_textarea textarea{
      height: 472px ;
      resize: none ;
  }

 .avatar-uploader .el-upload {
    border: 1px solid #d9d9d9;
    border-radius: 6px;
    cursor: pointer;
    position: relative;
    overflow: hidden;
  }
  .avatar-uploader .el-upload:hover {
    border-color: #409EFF;
  }
  .el-upload--picture-card{
      border: 1px solid #d9d9d9;
  }
  .avatar-uploader-icon {
    font-size: 28px;
    color: #8c939d;
    width: 178px;
    height: 178px;
    line-height: 178px;
    text-align: center;
  }
  .avatar {
    width: 178px;
    height: 178px;
    display: block;
  }
  .channel_nav4_tst{
      font-size: 14px;
      color: #333;
      padding-bottom: 60px;
  }
  .channel_nav4_tst p{
      margin-top: 20px;
  }
  .channel_nav4_tst div{
      margin-top: 5px;
  }
  .channel_nav2>div,.channel_nav3>div{
      /* margin-top: 30px; */
      border-bottom: 1px solid #ccc;
      padding: 0 0 50px 0;
      margin-bottom: 50px;
      font-size: 14px;
  }
  .channel_nav2>div:last-child{
      border: 0;
      margin-bottom: 0;
  }
  .channel_nav2>div>div{
      margin-top: 20px;
  }
  .channel_nav2>div>div>p{
      margin-left: 20px;
      margin-top: 5px;
      line-height: 23px;
  }
  .el-form-item__label{
      color: red !important;
  }
  .uploadImg img{
      margin-right: 20px;
      width: 160px;
      height: 160px;
  }
  .uploadImgAdd{
      height: 160px;
      width: 160px;
      background: url(https://ag-home.oss-cn-beijing.aliyuncs.com/imgs/upload_pictures.png) no-repeat;
  }
.vue-uploader .file-list:after {
    content: '';
    display: block;
    clear: both;
    visibility: hidden;
    line-height: 0;
    height: 0;
    font-size: 0;
}
.vue-uploader .file-list .file-item {
    float: left;
    position: relative;
    width: 160px;
    text-align: center;
    margin-right: 17.5px;
    border-radius: 2px;
}
.vue-uploader .file-list .file-item img{
    width: 160px;
    height: 160px;
    border: 1px solid #999;
    border-radius: 2px;
}
.vue-uploader .file-list .file-item .file-remove {
    position: absolute;
    right: 4px;
    display: none;
    top: 4px;
    width: 20px;
    height: 20px;
    font-size:20px;
    text-align: center;
    color: white;
    cursor: pointer;
    line-height: 17px;
    border-radius: 100%;
    transform: rotate(45deg);
    background: rgba(0, 0, 0, 0.5);
}
.vue-uploader .file-list .file-item:hover .file-remove {
    display: inline;
}
.vue-uploader .file-list .file-item .file-name {
    margin: 0;
    height: 40px;
    word-break: break-all;
    font-size: 14px;
    overflow: hidden;
    text-overflow: ellipsis;
    display: -webkit-box;
    -webkit-line-clamp: 2;
    -webkit-box-orient: vertical;
}
.vue-uploader .add {
    width: 160px;
    height: 160px;
    float: left;
    text-align: center;
    cursor: pointer;
    background: url(https://ag-home.oss-cn-beijing.aliyuncs.com/imgs/upload_pictures.png) no-repeat; 
    background-size: 100% 100%;
}
.vue-uploader .upload-func {
    display: flex;
    /* padding: 10px; */
    margin: 0px;
    /* background: #f8f8f8;
    border-top: 1px solid #ececec; */
}
.vue-uploader .upload-func .progress-bar {
    flex-grow: 1;
}
.vue-uploader .upload-func .progress-bar section {
    margin-top: 5px;
    background: #00b4aa;
    border-radius: 3px;
    text-align: center; 
    color: #fff;
    font-size: 12px;
    transition: all .5s ease;
}
.vue-uploader .upload-func .operation-box {
    flex-grow: 0;
    padding-left: 10px;
}
.vue-uploader .upload-func .operation-box button {
    padding: 4px 12px;
    color: #fff;
    background: #007ACC;
    border: none;
    border-radius: 2px;
    cursor: pointer;
}
.vue-uploader > input[type="file"] {
    display: none;
}
.el-table__row .cell {
  /* white-space: pre-line; */
  white-space:pre;
}
.el-table__row td:nth-child(2),.el-table__row td:nth-child(6),.has-gutter th:nth-child(3) .cell,.has-gutter th:nth-child(4) .cell,.el-table_2_column_3{
    text-align: left !important;
}
tbody>.el-table__row:nth-child(1) td:nth-child(6),.has-gutter .cell,tbody .el-table__row:nth-child(3) .el-table_2_column_3{
    text-align: center !important;
}
.channel_nav1 .el-form-item__content{
    display: flex;
    justify-content: space-between;
}
.channel_nav1 .form_box_content div:nth-child(4)>div div{
    margin-right: 10px;
    width: 100%;
}
.channel_nav1 .form_box_content div:nth-child(4)>div div:nth-child(3){
    margin-right: 0;
}
</style>
